---
type: MessageBoxShowingEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# MessageBoxShowingEventArgs

`Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | DialogType | 2010 | `public int DialogType { get ; }` |
| Property | Message | 2010 | `public string Message { get ; }` |